tobiaslenz1988/OilLevelTempSensor_GC9A01_3_0_ESP32_S3/uds_statemachine_common.cpp
#include "esp32-hal.h"
#include <Arduino.h>
#include <stdio.h>

#include <string.h>
#include <BluetoothSerial.h>
#include <Preferences.h>


#include "uds_statemachine_common.h"
#include "bus_common.h"
#include "oilsensor_common.h"
#include "nrc_uds_protocol_common.h"
#include "brand_defines_common.h"
#include "softwareversion.h"

extern Preferences preferences;
extern BluetoothSerial SerialBT;
extern uint8_t session;
extern String  PartNumberOilTempSensor   ;      
extern String  PartNumberWaterTempSensor ;      
extern String  HWModuleName              ;     


void delete_BT_buffer()
{
  for(int z=0;z<Buffersize;z++)
  {
    BT_rx_buffer[z]=0xFF;  
  }
}

void analyse_BT_Protocol(uint8_t receive_BT_Array[])
{   
  if(NewData == true){
    /*Command to read something*/
    if (receive_BT_Array[0]==UDS_READ_DATA_BY_IDENTIFIER)
    {
	    uint8_t posResponse = (UDS_READ_DATA_BY_IDENTIFIER + 0x40);
      /* 0x22 0xF1 0xAB */
      /* Get SW Version*/
      if((receive_BT_Array[1]==0xF1) && (receive_BT_Array[2]==0xAB))
      {
        BUS_output(posResponse);
        BUS_output(0xF1);
        BUS_output(0xAB); 
        BUS_output(SOFTWAREVERSION[0]);
        BUS_output(SOFTWAREVERSION[1]);
        BUS_output(SOFTWAREVERSION[2]);
        BUS_output(SOFTWAREVERSION[3]);
      }else

      /* 0x22 0xF1 0x86 */
      /* Get actual Sesion */
      if((receive_BT_Array[1]==0xF1) && (receive_BT_Array[2]==0x86))
      {
        BUS_output(posResponse);
        BUS_output(0xF1);
        BUS_output(0x86); 
        BUS_output(session);
      }else


      
      /* 0x22 0xF1 0x91 */
      /* Get PartNumber of OilTempSensor */
      if((receive_BT_Array[1]==0xF1) && (receive_BT_Array[2]==0x91))
      {
        BUS_output(posResponse);
        BUS_output(0xF1);
        BUS_output(0x91); 
        uint8_t i=0;
        while(PartNumberOilTempSensor[i] != '-')
        {
          BUS_output(PartNumberOilTempSensor[i]);
          i=i+1;
        }
    
      }else

      /* 0x22 0xF1 0x92 */
      /* Get PartNumber of WaterTempSensor */
      if((receive_BT_Array[1]==0xF1) && (receive_BT_Array[2]==0x92))
      {
        BUS_output(posResponse);
        BUS_output(0xF1);
        BUS_output(0x92); 
        uint8_t i=0;
        while(PartNumberWaterTempSensor[i] != '-')
        {
          BUS_output(PartNumberWaterTempSensor[i]);
          i=i+1;
        }
      }else

      /* 0x22 0xF1 0x93 */
      /* Get Name of Central Chip */
      if((receive_BT_Array[1]==0xF1) && (receive_BT_Array[2]==0x93))
      {
        BUS_output(posResponse);
        BUS_output(0xF1);
        BUS_output(0x93); 
        uint8_t i=0;
        while(HWModuleName[i] != '-')
        {
          BUS_output(HWModuleName[i]);
          i=i+1;
        }
      }else


      /* 0x22 0xF1 0x97 */
      /* get Systemname */
      if((receive_BT_Array[1]==0xF1) && (receive_BT_Array[2]==0x97))
      {
        BUS_output(posResponse);
        BUS_output(0xF1);
        BUS_output(0x97);
  
        //temp.toCharArray(Modulename, leng);
        //BUS_output(temp);
        uint8_t sizeOfArr = sizeof(Modulename) / sizeof(Modulename[0]);
        uint8_t i;
        while(Modulename[i] != 0x00)
        {
          BUS_output(Modulename[i]);
          i=i+1;
        }
        
      }else
      
      /* This part should read the coding
      /* 0x22 0x06 0x00 ......*/
      if((receive_BT_Array[1]==0x06) && (receive_BT_Array[2]==0x00))
      {
          BUS_output(posResponse);
          BUS_output(0x06);
          BUS_output(0x00); 
          BUS_output(brandSelector);
          BUS_output(NewOilSensorEquipped);

      }else





      /* 0x22 0x06 0x01 */
      /* This part should get the Debugvalue for the OilTemperature */
      if((receive_BT_Array[1]==0x06) && (receive_BT_Array[2]==0x01))
      {
        BUS_output(posResponse);
        BUS_output(0x06);
        BUS_output(0x01);                  
        BUS_output(testValue_oilTemperature);
        
      }else

      /* 0x22 0x06 0x02 */
       /* This part should get the Debugvalue for the OilLevel */
      if((receive_BT_Array[1]==0x06) && (receive_BT_Array[2]==0x02))
      {
        BUS_output(posResponse);
        BUS_output(0x06);
        BUS_output(0x02);                  
        BUS_output(testValue_oilLevelPercentage);
        
      }else
      
      
      /* 0x22 0x06 0x03 */
      /* Returns the OilTemperature  in Degree Celsius which is used by the SW*/
      if((receive_BT_Array[1]==0x06) && (receive_BT_Array[2]==0x03))
      {
        BUS_output(posResponse);
        BUS_output(0x06);
        BUS_output(0x03);                  
        BUS_output(oilTemperature);
        
      }else
      
      /* 0x22 0x06 0x04 */
      /* Returns the Oillevel in percent which is used by the SW*/
      if((receive_BT_Array[1]==0x06) && (receive_BT_Array[2]==0x04))
      {
        BUS_output(posResponse);
        BUS_output(0x06);
        BUS_output(0x04);                  
        BUS_output(oilLevelPercentage);
        
      }else

      /* 0x22 0x06 0x0A */
      /* get the Brandvalue */
      if((receive_BT_Array[1]==0x06) && (receive_BT_Array[2]==0x0A))
      {
        BUS_output(posResponse);
        BUS_output(0x06);
        BUS_output(0x0A);                  
        BUS_output(brandSelector);
      }
      else



      /* 0x22 0x06 0x0B */
      /* get ExtraOutputPin flag*/
      if((receive_BT_Array[1]==0x06) && (receive_BT_Array[2]==0x0B))
      {
        BUS_output(posResponse);
        BUS_output(0x06);
        BUS_output(0x0B);                  
        BUS_output(statusOfExtraOutputPin);
        
      }else


      /* 0x22 0x06 0x0C */
      /* get OldSensorNewSensor flag*/
      if((receive_BT_Array[1]==0x06) && (receive_BT_Array[2]==0x0C))
      {
        BUS_output(posResponse);
        BUS_output(0x06);
        BUS_output(0x0C);                  
        BUS_output(NewOilSensorEquipped);
        
