tobiaslenz1988/OilLevelTempSensor_GC9A01_3_0_ESP32_S3/uds_statemachine_common.cpp
      }
      else
      
      /* 0x22 0x07 0x00 */
      /* get Oiltemperature compare values for OldSensor */
      if((receive_BT_Array[1]==0x07) && (receive_BT_Array[2]==0x00))
      {
        BUS_output(posResponse);
        BUS_output(0x07);
        BUS_output(0x00); 
        uint8_t i = 0;
        uint8_t tempvar;
        uint8_t sizeOfArr = sizeof(OldOilTempCompValues) / sizeof(OldOilTempCompValues[0]);
        for(i=0;i<sizeOfArr;i++)
        {

            /* As example testval =         500 == 0x01F4    */
            /* BUS_output(testval >> 8);         -> 0x01 */
            /* BUS_output(testval & 0xFF);       -> 0xF4 */
          tempvar = (OldOilTempCompValues[i] >> 8) ;
          BUS_output(tempvar);
          tempvar = (OldOilTempCompValues[i] & 0xFF);
          BUS_output(tempvar);
        }                   
      }else
      
      /* 0x22 0x07 0x01 */
      /* get Oillevel compare values for OldSensor*/
      if((receive_BT_Array[1]==0x07) && (receive_BT_Array[2]==0x01))
      {
        BUS_output(posResponse);
        BUS_output(0x07);
        BUS_output(0x01);                  
        uint8_t i = 0;
        uint8_t tempvar;
        uint8_t sizeOfArr = sizeof(OldOilLevelCompValues) / sizeof(OldOilLevelCompValues[0]);
        for(i=0;i<sizeOfArr;i++)
        {
            /* As example testval =         500 == 0x01F4    */
            /* BUS_output(testval >> 8);         -> 0x01 */
            /* BUS_output(testval & 0xFF);       -> 0xF4 */
          tempvar = (OldOilLevelCompValues[i] >> 8) ;
          BUS_output(tempvar);
          tempvar = (OldOilLevelCompValues[i] & 0xFF);
          BUS_output(tempvar);
        } 
        
      }else

      /* 0x22 0x07 0x02 */
      /* tbd */
      if((receive_BT_Array[1]==0x07) && (receive_BT_Array[2]==0x02))
      {
        BUS_output(posResponse);
        BUS_output(0x07);
        BUS_output(0x02);
        
      }else

      /* 0x22 0x07 0x03 */
      /* tbd */
      if((receive_BT_Array[1]==0x07) && (receive_BT_Array[2]==0x03))
      {
        BUS_output(posResponse);
        BUS_output(0x07);
        BUS_output(0x03);
        
      }else



      {
        BUS_output(0x7F);
        BUS_output(UDS_READ_DATA_BY_IDENTIFIER);
        BUS_output(UDS_NRC_requestOutOfRange);
      }
  
    
    }else
    

    /*Command to write something*/
    if(receive_BT_Array[0] == UDS_WRITE_DATA_BY_IDENTIFIER)
    {
      uint8_t posResponse = (UDS_WRITE_DATA_BY_IDENTIFIER + 0x40);

      /* 0x2E 0xf1 0x91 */
      /* set PartNumber of OilTempSensor */
      if((receive_BT_Array[1]==0xF1) && (receive_BT_Array[2]==0x91))
      {

          uint8_t i; 
          String tempStr;
          PartNumberOilTempSensor = {'-','-','-','-','-', '-','-','-','-','-', '-','-','-','-','-',};
          uint8_t length_of_name = receive_BT_Array[3];
          for (i=0;i<length_of_name;i++)
          {
            //Modulename[i] =  (char) receive_BT_Array[4+i];
            tempStr.concat((char) receive_BT_Array[4+i]);
            PartNumberOilTempSensor[i] = receive_BT_Array[4+i];
          }
      
          preferences.begin(EEPROMNameSpace, false); 
          preferences.putString("PartNumberOilTempSensor",tempStr);
          preferences.end();
          BUS_output(posResponse);
          BUS_output(0xF1);
          BUS_output(0x91); 
      }
      else

      /* 0x2E 0xf1 0x92 */
      /* set PartNumber of WaterTempSensor */
      if((receive_BT_Array[1]==0xF1) && (receive_BT_Array[2]==0x92))
      {

          uint8_t i; 
          String tempStr;
          PartNumberWaterTempSensor = {'-','-','-','-','-', '-','-','-','-','-','-','-','-','-','-' };
           uint8_t length_of_name = receive_BT_Array[3];
          for (i=0;i<length_of_name;i++)
          {
            //Modulename[i] =  (char) receive_BT_Array[4+i];
            tempStr.concat((char) receive_BT_Array[4+i]);
            PartNumberWaterTempSensor[i] = receive_BT_Array[4+i];
          }
      
          preferences.begin(EEPROMNameSpace, false); 
          preferences.putString("PartNumberWaterTempSensor",tempStr);
          preferences.end();
          BUS_output(posResponse);
          BUS_output(0xF1);
          BUS_output(0x92); 
      }
      else

      /* 0x2E 0xf1 0x93 */
      /* set Name of central chip */
      if((receive_BT_Array[1]==0xF1) && (receive_BT_Array[2]==0x93))
      {

          uint8_t i; 
          String tempStr;
          HWModuleName = {'-','-','-','-','-',    '-','-','-','-','-',    '-','-','-','-','-', };
           uint8_t length_of_name = receive_BT_Array[3];
          for (i=0;i<length_of_name;i++)
          {
            //Modulename[i] =  (char) receive_BT_Array[4+i];
            tempStr.concat((char) receive_BT_Array[4+i]);
            HWModuleName[i] = receive_BT_Array[4+i];
          }
      
          preferences.begin(EEPROMNameSpace, false); 
          preferences.putString("HWModuleName",tempStr);
          preferences.end();
          BUS_output(posResponse);
          BUS_output(0xF1);
          BUS_output(0x93); 
      }
      else


      /* This part should change the name of the BT Module*/
      /* 0x2E 0xF1 0x97 0x?? 0x!!  0x!! 0x!! 0x!!......*/
      if((receive_BT_Array[1]==0xF1) && (receive_BT_Array[2]==0x97))
      {
        uint8_t length_of_name = receive_BT_Array[3];
        if((0<length_of_name) && (length_of_name<=20))
        {
          uint8_t i; 
          String tempStr;
          Modulename =    {0,0,0,0,0, 0,0,0,0,0 ,0,0,0,0,0, 0,0,0,0,0};
          for (i=0;i<length_of_name;i++)
          {
            //Modulename[i] =  (char) receive_BT_Array[4+i];
            tempStr.concat((char) receive_BT_Array[4+i]);
            Modulename[i] = receive_BT_Array[4+i];
          }
      
         /*  
          for (i=0;i<length_of_name;i++)
          {
            Modulename[i] = Temparr[i];
          }
          */
       
          preferences.begin(EEPROMNameSpace, false); 
          preferences.putString("Modulename",tempStr);
          preferences.end();
          //Modulename =  Temparray;
          SerialBT.begin(tempStr);
         // Modulename=Temparr;
          BUS_output(posResponse);
          BUS_output(0xF1);
          BUS_output(0x97); 
        }else{
          BUS_output(0x7F);
          BUS_output(UDS_WRITE_DATA_BY_IDENTIFIER);
          BUS_output(UDS_NRC_incorrectMessageLengthOrInvalidFormat);
        }
      }
      else

