tobiaslenz1988/OilLevelTempSensor_GC9A01_3_0_ESP32_S3/uds_statemachine_common.cpp
      }else
       /* This part should set the compare values for Oillevel old sensor
      /* 0x2E 0x07 0x01 0x!! 0x!!  0x!! 0x!! 0x!!......*/
      if((receive_BT_Array[1]==0x07) && (receive_BT_Array[2]==0x01))
      {
        uint8_t val  = NULL;
        val = receive_BT_Array[3];
        if(val == NULL)
        {
          BUS_output(0x7f);
          BUS_output(0x2e);
          BUS_output(UDS_NRC_incorrectMessageLengthOrInvalidFormat);
        }
        else
        {
          preferences.begin(EEPROMNameSpace, false); 
          uint16_t temp = ((uint16_t) receive_BT_Array[3]<<8)|receive_BT_Array[4];
          preferences.putShort("Old_sensor_OilLevelEmpty",temp);
          temp = ((uint16_t) receive_BT_Array[5]<<8)|receive_BT_Array[6];
          preferences.putShort("Old_sensor_OilLevel_10",temp);
          temp = ((uint16_t) receive_BT_Array[7]<<8)|receive_BT_Array[8];
          preferences.putShort("Old_sensor_OilLevel_20",temp);
          temp = ((uint16_t) receive_BT_Array[9]<<8)|receive_BT_Array[10];
          preferences.putShort("Old_sensor_OilLevel_30",temp);
          temp = ((uint16_t) receive_BT_Array[11]<<8)|receive_BT_Array[12];
          preferences.putShort("Old_sensor_OilLevel_40",temp);
          temp = ((uint16_t) receive_BT_Array[13]<<8)|receive_BT_Array[14];
          preferences.putShort("Old_sensor_OilLevel_50",temp);
          temp = ((uint16_t) receive_BT_Array[15]<<8)|receive_BT_Array[16];
          preferences.putShort("Old_sensor_OilLevel_60",temp);
          temp = ((uint16_t) receive_BT_Array[17]<<8)|receive_BT_Array[18];
          preferences.putShort("Old_sensor_OilLevel_70",temp);
          temp = ((uint16_t) receive_BT_Array[19]<<8)|receive_BT_Array[20];
          preferences.putShort("Old_sensor_OilLevel_80",temp);
          temp = ((uint16_t) receive_BT_Array[21]<<8)|receive_BT_Array[22];
          preferences.putShort("Old_sensor_OilLevel_90",temp);
          temp = ((uint16_t) receive_BT_Array[23]<<8)|receive_BT_Array[24];
          preferences.putShort("Old_sensor_OilLevelFull",temp);

          preferences.end();

          BUS_output(posResponse);
          BUS_output(0x07);
          BUS_output(0x01); 
        }
      }else







      /* tbd */
      /* 0x2E 0x07 0x02 0x!!......*/
      if((receive_BT_Array[1]==0x07) && (receive_BT_Array[2]==0x02))
      {

        uint8_t  val = NULL;
        val = (uint8_t)receive_BT_Array[3];
        if(val == NULL)
        {
          BUS_output(0x7f);
          BUS_output(0x2e);
          BUS_output(UDS_NRC_incorrectMessageLengthOrInvalidFormat);
        }
        else
        {

          BUS_output(posResponse);
          BUS_output(0x07);
          BUS_output(0x02); 
        }
      }else


      /* tbd */
      /* 0x2E 0x07 0x03 0x!!......*/
      if((receive_BT_Array[1]==0x07) && (receive_BT_Array[2]==0x03))
      {

        uint8_t  val = NULL;
        val = (uint8_t)receive_BT_Array[3];
        if(val == NULL)
        {
          BUS_output(0x7f);
          BUS_output(0x2e);
          BUS_output(UDS_NRC_incorrectMessageLengthOrInvalidFormat);
        }
        else
        {

          BUS_output(posResponse);
          BUS_output(0x07);
          BUS_output(0x03); 
        }
      }else


      {
        BUS_output(0x7F);
        BUS_output(UDS_WRITE_DATA_BY_IDENTIFIER);
        BUS_output(UDS_NRC_requestOutOfRange);
      }
    }else

    /* Session Control */
    if(receive_BT_Array[0] == UDS_Session_Control)
    {
      if((receive_BT_Array[1] == UDS_Session_Control_Default_Session)||(receive_BT_Array[1] == UDS_Session_Control_Extended_Session)||(receive_BT_Array[1] == UDS_Session_Control_Development_Session))
      {
          
          if(session != receive_BT_Array[1])
          {
            session = receive_BT_Array[1];
            preferences.begin(EEPROMNameSpace, false); 
            preferences.putUChar("session",receive_BT_Array[1]);
            preferences.end();
          }
          
          BUS_output(0x50);
      }else{
        BUS_output(0x7F);
        BUS_output(UDS_Session_Control);
        BUS_output(UDS_NRC_subFunctionNotSupported);
      }
    }else
    
    if(receive_BT_Array[0] == UDS_ECU_Reset)
    {
      if(receive_BT_Array[1] == UDS_ECU_Reset_KeyOnOffReset)
      {
        BUS_output(0x51);
        delay(1500);
        ESP.restart();
      }
    }
    else
  
    {
        BUS_output(0x7F);
        BUS_output(receive_BT_Array[0]);
        BUS_output(UDS_NRC_serviceNotSupported);
    }
    delete_BT_buffer();
  }
  NewData = false;
}






